Revit 2026 API

# BuiltInFailuresStructuralCustomConnectionFailures Class

---

Failures about StructuralConnectionHandler.

SystemObject Autodesk.Revit.DBBuiltInFailuresStructuralCustomConnectionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class StructuralCustomConnectionFailures
```
```vb
Public NotInheritable Class StructuralCustomConnectionFailures
```
```cpp
public ref class StructuralCustomConnectionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralCustomConnectionFailures = class end
```

The BuiltInFailuresStructuralCustomConnectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SimpleConnectionTooFarRefs | Simple Structural Connection Handler cannot connect too far elements |
|  | StructuralCannotCreateCustomConnection | Could not create a custom connection. |
|  | StructuralCustomConnectionComponentsRelationship | Cannot create custom connection due to relationships to external elements. |
|  | StructuralCustomConnectionEmpty | Structural Custom Connection cannot be empty. |
|  | StructuralCustomConnectionWrongType | Structural Custom Connection has an inappropriate type assigned. |

#### Reference

Autodesk.Revit.DB Namespace